IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/EPWM7_EPWM.xml
<module name="EPWM7_EPWM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="EPWM_REGS_TBCTL" acronym="EPWM_REGS_TBCTL" offset="0x0" width="16" description="Time-Base Control Register">
		<bitfield id="FREE_SOFT" width="2" begin="15" end="14" resetval="0x0" description="Emulation Mode Bits These bits select the behavior of the ePWM time-base counter during emulation events:" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="PHSDIR" width="1" begin="13" end="13" resetval="0x0" description="Phase Direction Bit This bit is only used when the time-base counter is configured in the up-down-count mode The PHSDIR bit indicates the direction the time-base counter [TBCNT] will count after a synchronization event occurs and a new phase value is loaded from the phase [TBPHS] register This is irrespective of the direction of the counter before the synchronization event In the up-count and down-count modes this bit is ignored" range="13" rwaccess="R/W"/> 
		<bitfield id="CLKDIV" width="3" begin="12" end="10" resetval="0x0" description="Time-base Clock Prescale Bits These bits determine part of the time-base clock prescale value TBCLK = SYSCLKOUT/[HSPCLKDIV - CLKDIV]" range="12 - 10" rwaccess="R/W"/> 
		<bitfield id="HSPCLKDIV" width="3" begin="9" end="7" resetval="0x1" description="High-Speed Time-base Clock Prescale Bits These bits determine part of the time-base clock prescale value TBCLK = SYSCLKOUT/[HSPCLKDIV - CLKDIV] This divisor emulates the HSPCLK in the TMS320x281x system as used on the Event Manager [EV] peripheral" range="9 - 7" rwaccess="R/W"/> 
		<bitfield id="SWFSYNC" width="1" begin="6" end="6" resetval="0x0" description="Software Forced Synchronization Pulse" range="6" rwaccess="R/W"/> 
		<bitfield id="SYNCOSEL" width="2" begin="5" end="4" resetval="0x0" description="Synchronization Output Select These bits select the source of the EPWMxSYNCO signal" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRDLD" width="1" begin="3" end="3" resetval="0x0" description="Active Period Register Load From Shadow Register Select" range="3" rwaccess="R/W"/> 
		<bitfield id="PHSEN" width="1" begin="2" end="2" resetval="0x0" description="Counter Register Load From Phase Register Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="CTRMODE" width="2" begin="1" end="0" resetval="0x3" description="Counter Mode The time-base counter mode is normally configured once and not changed during normal operation If you change the mode of the counter, the change will take effect at the next TBCLK edge and the current counter value shall increment or decrement from the value before the mode change These bits set the time-base counter mode of operation as follows:" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_TBSTS" acronym="EPWM_REGS_TBSTS" offset="0x2" width="16" description="Time-Base Status Register">
		<bitfield id="CTRMAX" width="1" begin="2" end="2" resetval="0x0" description="Time-Base Counter Max Latched Status Bit" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="SYNCI" width="1" begin="1" end="1" resetval="0x0" description="Input Synchronization Latched Status Bit" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CTRDIR" width="1" begin="0" end="0" resetval="0x0" description="Time-Base Counter Direction Status Bit At reset, the counter is frozen, therefore, this bit has no meaning To make this bit meaningful, you must first set the appropriate mode via TBCTL[CTRMODE]" range="0" rwaccess="R"/>
	</register>
	<register id="EPWM_REGS_TBPHSHR" acronym="EPWM_REGS_TBPHSHR" offset="0x4" width="16" description="Time Base Phase High Resolution Register">
		<bitfield id="TBPHSH" width="8" begin="15" end="8" resetval="0x0" description="Time-base phase high-resolution bits" range="15 - 8" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_TBPHS" acronym="EPWM_REGS_TBPHS" offset="0x6" width="16" description="Time Base Phase Register. This register is only available on ePWM instances that include the high-resolution PWM (HRPWM) extension, otherwise, this location is reserved.">
		<bitfield id="TBPHS" width="16" begin="15" end="0" resetval="0x0" description="These bits set time-base counter phase of the selected ePWM relative to the time-base that is supplying the synchronization input signal [a] If TBCTL[PHSEN] = 0, then the synchronization event is ignored and the time-base counter is not loaded with the phase [b] If TBCTL[PHSEN] = 1, then the time-base counter [TBCNT] will be loaded with the phase [TBPHS] when a synchronization event occurs The synchronization event can be initiated by the input synchronization signal [EPWMxSYNCI] or by a software forced synchronization " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_TBCNT" acronym="EPWM_REGS_TBCNT" offset="0x8" width="16" description="Time Base Counter Register">
		<bitfield id="TBCNT" width="16" begin="15" end="0" resetval="0x0" description="Reading these bits gives the current time-base counter value Writing to these bits sets the current time-base counter value The update happens as soon as the write occurs The write is NOT synchronized to the time-base clock [TBCLK] and the register is not shadowed" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_TBPRD" acronym="EPWM_REGS_TBPRD" offset="0xA" width="16" description="Time Base Period Register">
		<bitfield id="TBPRD" width="16" begin="15" end="0" resetval="0x0" description="These bits determine the period of the time-base counter This sets the PWM frequency Shadowing of this register is enabled and disabled by the TBCTL[PRDLD] bit By default this register is shadowed [a] If TBCTL[PRDLD] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register In this case, the active register will be loaded from the shadow register when the time-base counter equals zero [b] If TBCTL[PRDLD] = 1, then the shadow is disabled and any write or read will go directly to the active register, that is the register actively controlling the hardware [c] The active and shadow registers share the same memory map address " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_CMPCTL" acronym="EPWM_REGS_CMPCTL" offset="0xE" width="16" description="Counter Compare Control Register">
		<bitfield id="SHDWBFULL" width="1" begin="9" end="9" resetval="0x0" description="Counter-compare B [CMPB] Shadow Register Full Status Flag This bit self clears once a load-strobe occurs" range="9" rwaccess="R"/> 
		<bitfield id="SHDWAFULL" width="1" begin="8" end="8" resetval="0x0" description="Counter-compare A [CMPA] Shadow Register Full Status Flag The flag bit is set when a 32 bit write to CMPA:CMPAHR register or a 16 bit write to CMPA register is made A 16 bit write to CMPAHR register will not affect the flag This bit self clears once a load-strobe occurs" range="8" rwaccess="R"/> 
		<bitfield id="SHDWBMODE" width="1" begin="6" end="6" resetval="0x0" description="Counter-compare B [CMPB] Register Operating Mode" range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWAMODE" width="1" begin="4" end="4" resetval="0x0" description="Counter-compare A [CMPA] Register Operating Mode" range="4" rwaccess="R/W"/> 
		<bitfield id="LOADBMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Counter-Compare B [CMPB] Load From Shadow Select Mode This bit has no effect in immediate mode [CMPCTL[SHDWBMODE] = 1]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LOADAMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Counter-Compare A [CMPA] Load From Shadow Select Mode This bit has no effect in immediate mode [CMPCTL[SHDWAMODE] = 1]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_CMPAHR" acronym="EPWM_REGS_CMPAHR" offset="0x10" width="16" description="Counter Compare A High Resolution Register. This register is only available on ePWM instances that include the high-resolution PWM (HRPWM) extension; otherwise, this location is reserved.">
		<bitfield id="CMPAHR" width="8" begin="15" end="8" resetval="0x0" description="Compare A High-Resolution register bits for MEP step control A minimum value of 1h is needed to enable HRPWM capabilities Valid MEP range of operation 1-255h " range="15 - 8" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_CMPA" acronym="EPWM_REGS_CMPA" offset="0x12" width="16" description="Counter Compare A Register">
		<bitfield id="CMPA" width="16" begin="15" end="0" resetval="0x0" description="The value in the active CMPA register is continuously compared to the time-base counter [TBCNT] When the values are equal, the counter-compare module generates a time-base counter equal to counter compare A event This event is sent to the action-qualifier where it is qualified and converted it into one or more actions These actions can be applied to either the EPWMxA or the EPWMxB output depending on the configuration of the AQCTLA and AQCTLB registers The actions that can be defined in the AQCTLA and AQCTLB registers include the following [a] Do nothing the event is ignored [b] Clear: Pull the EPWMxA and/or EPWMxB signal low [c] Set: Pull the EPWMxA and/or EPWMxB signal high [d] Toggle the EPWMxA and/or EPWMxB signal Shadowing of this register is enabled and disabled by the CMPCTL[SHDWAMODE] bit By default this register is shadowed [a] If CMPCTL[SHDWAMODE] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register In this case, the CMPCTL[LOADAMODE] bit field determines which event will load the active register from the shadow register [b] Before a write, the CMPCTL[SHDWAFULL] bit can be read to determine if the shadow register is currently full [c] If CMPCTL[SHDWAMODE] = 1, then the shadow register is disabled and any write or read will go directly to the active register, that is the register actively controlling the hardware [d] In either mode, the active and shadow registers share the same memory map address " range="15 - 0" rwaccess="R/W"/>
	</register>
